core/security/base/src/test/resources/org/switchyard/security/credential/extractor/SOAPMessageCredentialExtractorTests-Assertion.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:test="urn:switchyard-security:test-assertion:0.1.0">
    <soap:Header>
        <wsse:Security>
            <saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" ID="ID_00cdd057-e611-439d-a189-581e1437e560" IssueInstant="2012-09-27T11:16:21.714Z" Version="2.0">
                <saml:Issuer>PicketLinkSTS</saml:Issuer>
                <dsig:Signature xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">
                    <dsig:SignedInfo>
                        <dsig:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#WithComments"/>
                        <dsig:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                        <dsig:Reference URI="#ID_00cdd057-e611-439d-a189-581e1437e560">
                            <dsig:Transforms>
                                <dsig:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                                <dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                            </dsig:Transforms>
                            <dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                            <dsig:DigestValue>0I4VREOz6/E7fEaeAkwnVk2AyZw=</dsig:DigestValue>
                        </dsig:Reference>
                    </dsig:SignedInfo>
                    <dsig:SignatureValue>eFdKOlRlnTre8cWdyM7NPanKE1n0uRMIMWvr5mWAVSoY7sSAm4I/cBs5gXjGxp45NPo2C2pjjdvc+EoJd2xvxYx6z3qsHMfK3EGDoLXJusjSB+hgXGZ8UgjjktHVkA5NOwwdY2xFmglAINWYMGi+cOezYUNhb4OEJWoPsXMI9qg=</dsig:SignatureValue>
                    <dsig:KeyInfo>
                        <dsig:KeyValue>
                            <dsig:RSAKeyValue>
                                <dsig:Modulus>suGIyhVTbFvDwZdx8Av62zmP+aGOlsBN8WUE3eEEcDtOIZgO78SImMQGwB2C0eIVMhiLRzVPqoW1dCPAveTm653zHOmubaps1fY0lLJDSZbTbhjeYhoQmmaBro/tDpVw5lKJns2qVnMuRK19ju2dxpKwlYGGtrP5VQv00dfNPbs=</dsig:Modulus>
                                <dsig:Exponent>AQAB</dsig:Exponent>
                            </dsig:RSAKeyValue>
                        </dsig:KeyValue>
                    </dsig:KeyInfo>
                </dsig:Signature>
                <saml:Subject>
                    <saml:NameID NameQualifier="urn:picketlink:identity-federation">admin</saml:NameID>
                    <saml:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"/>
                </saml:Subject>
                <saml:Conditions NotBefore="2012-09-27T11:16:21.714Z" NotOnOrAfter="2012-09-27T13:16:21.714Z"/>
                <saml:AuthnStatement AuthnInstant="2012-09-27T11:16:21.714Z">
                    <saml:AuthnContext>
                        <saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:cm:bearer</saml:AuthnContextClassRef>
                    </saml:AuthnContext>
                </saml:AuthnStatement>
            </saml:Assertion>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <test:foo>bar</test:foo>
    </soap:Body>
</soap:Envelope>
